Tekla.Structures.DirectManipulation.Model.DialogHelper
The Tekla.Structures.DirectManipulation.Model.DialogHelper class provides methods for handling events that occur in the native dialogs.

Tekla.Structures.DirectManipulation.Model.DialogHelper.SetRebarSetAppliedUdasCallback(Tekla.Structures.DirectManipulation.Model.UpdateRebarSetAppliedUDAsDelegate)
Sets a callback for when the applied UDA values are changed for the RebarSet class.
p: The function to call when the values are changed.